test = int(input("Тест на ишака, введите цифры 1 или 2 : "))

if (test == 1) :
    print("Ты ишак!!! Иди лечись")
elif (test == 2) :
    print("Ты не ишак, ай малядець!")
else :
    print("Введи 1 или 2! Дегроид")

print()

test2 = int(input("Вопрос 2! Есть ли у Ишака рога? 1-да 2-нет : "))

if (test2 == 1) :
    print("Правильно, ай малядець!")
elif (test2 == 2) :
    print("Ты шо дебилоид? У ишака есть рога!!!!!!!!")
else :
    print("Та ты шо дебилоид???? Выбери 1 или 2!!!!")

print()

test3 = int(input("Вопрос 3! Кто сильнее? : Ишак или баран?   1 - ишак 2 - баран : "))

if (test3 == 1) :
    print("Ай какой малядець!! Настоящий поклонник ишака!")
elif (test3 == 2) :
    print("Ну ты и в самом деле баран тупой! Конечно ишак сильнее!")
else :
    print("Не ну ты тупой, в самом деле.. ВЫБЕРИ 1 ИЛИ 2 НЕУЖЕЛИ ТАК СЛОЖНО?")

print()

test4 = int(input("Почему ишак есть ишак?  1-потому что   2-хз : "))

if (test4 == 1) :
    print("Правильно! Потому что так надо!")
elif (test4 == 2) :
    print("Дегроид тупой!")
else :
    print("Тебе мозги вправить????? 1 ИЛИ 2 ЗАДАНИЕ ДЛЯ 1 IQ")

print()

test5 = int(input("Кто отчим?  1-Тобик  2-Малыш : "))

if (test5 == 1) :
    print("Не правильно! Тобик не отчим! Он ишак!")
elif (test5 == 2) :
    print("Конечно малыш, этот козёл всех собак в округе оприходовал")
else :
    print("Ливай нахер отсюда! ПОШЁЛ ВОН!!")

print ()

test6 = int(input("Кто надристал??  1-отчим  2-ишак : "))

if (test6 == 1) :
    print("Конечно отчим!")
elif (test6 == 2) :
    print("Как ты мог такое подумать?! Нелюдь! Скот!")
else :
    print("Иди убейся")

print()

print("Ай малядець! тест прошёл!")

